# Missing Values(Eksik Veriler)

In [40]:
import numpy as np
import pandas as pd

In [41]:
# 3.Kurda öğreneceğimiz Makine öğrenmesi algoritmalarının pek çoğu missing valuelarla çalışmaz. Bu yüzden bunları biz handle(başa çıkmak) etmeliyiz.
# Missing value kavramı 'Eksik veri' anlamına gelir ve datamız içindeki değeri bilinmeyen verileri ifade eder.
# Missing valuelar farklı formatlarda olabilir.

In [42]:
np.nan # En sık karşılaşacağımız eksik veri tipi budur.

nan

In [43]:
pd.NA

In [44]:
pd.NaT

NaT

In [45]:
5 == 5

True

In [46]:
np.nan == np.nan # Bir verinin nan olup olmadığını bu şekilde kontrol edemeyiz.

False

In [47]:
df = pd.read_csv('movie_scores.csv')
df.head()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [80]:
df.isna()           # df'in içindeki nan mı? anlamına geliyor. Yani nan olanları true döndürüyor.

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [81]:
df.isna().sum()        # nan değeri olanları sütun bazında toplamış oluyor.

first_name          0
last_name           0
age                 0
sex                 0
pre_movie_score     1
post_movie_score    1
dtype: int64

In [82]:
df.notna()             # burda ise nan olmayanları false döndürüyor.

   first_name  last_name   age   sex  pre_movie_score  post_movie_score
0        True       True  True  True             True              True
2        True       True  True  True            False             False
3        True       True  True  True             True              True
4        True       True  True  True             True              True

In [51]:
df.head()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [52]:
# Amaç : pre_movie_score sütunu nan olmayan satırları getirmek.

In [53]:
df[df['pre_movie_score'].notna()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [54]:
# Amaç : post_movie_score'u nan olan satırları getir.

In [55]:
df[df['post_movie_score'].isna()]

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [56]:
# pre_movie_score'u nan olan, age sütunu nan olmayanları getir.

In [57]:
df.head()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [58]:
df[(df['pre_movie_score'].isna()) & (df['age'].notna())]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

# Missing Valuelarla Yapılabilecek 3 şey vardır

In [59]:
# 1) Dokunmadan bırakabiliriz.
# 2) Drop edebiliriz(Satır veya sütun bazlı)
# 3) Mantıklı bir şekilde doldurabiliriz.

In [60]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [61]:
# 1.Yol : Yapılacak hiçbir şey yok. Bu şekilde işlemlerine devam et.

In [62]:
# 2.Yol :

In [63]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [83]:
df.dropna(how = 'any') # "how = any" Herhangi bir sütunu nan ise o satırı düşür.

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [84]:
df.dropna(how = 'all') # "how = all" Bütün sütunları nan ise o satırı düşür.

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [88]:
df.dropna(thresh= 1) # 1 tane bile nan olmayan veri varsa o satırı tut. "thresh" eşik değeri anlamında yani aşağıda 1. saturda hiç nan olmadığı için düştü.

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [67]:
df.dropna(thresh = 4)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [68]:
df.dropna(thresh = 5)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [69]:
df.head()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [86]:
df.dropna(axis = 1 , thresh = 4)       # Burda sütun düşürdük.

  first_name last_name   age sex
0        Tom     Hanks  63.0   m
2       Hugh   Jackman  51.0   m
3      Oprah   Winfrey  66.0   f
4       Emma     Stone  31.0   f

In [89]:
# 3.Yol : Fill the data(Datayı doldur.)  "Fill" doldurmak demek.

In [72]:
df.head()

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [73]:
df.dropna(how = 'all' , inplace = True)

In [74]:
df.head()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [75]:
df['pre_movie_score'].fillna(9.5)

0    8.0
2    9.5
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [76]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [77]:
# Done.